Autodesk.Revit.DB.RevitLinkType.UpdateFromIFC(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ExternalResourceReference,System.String,System.Boolean)
Updates a Revit link type from an IFC file and loads the linked document.
Remarks:
This function regenerates the input document.
While the options argument allows specification of a path type, the
input path argument must be a full path. Relative vs. absolute determines
how Revit will store the path, but it needs a complete path to find
the linked document initially.
Note that the IFC file will not be stored directly in the document; it will
instead by stored in an intermediate Revit document, whose location is given
by revitLinkedFilePath.
document:
The document that contains Revit link.
resourceReference:
An external resource reference describing the source of the IFC file used in creation.
revitLinkedFilePath:
The path of the Revit file to create to hold the IFC information. This must be a full path.
recreateLink:
If true, the Revit file will be updated based on the information in the IFC file.  If false, the existing Revit file will be used.
Returns:
Returns true if the update succeeded, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
The document is a cloud model.
-or-
The server referenced by the ExternalResourceReference does not exist or
does not implement IExternalResourceServer.
-or-
The server referenced by the ExternalResourceReference cannot support IFC links.
-or-
The ExternalResourceReference (resourceReference) is not in a format
that is supported by its server.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.FileAccessException:
The model cannot be accessed due to lack of access privileges.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Revit cannot customize worksets for this model.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2018

Autodesk.Revit.DB.RevitLinkType.CreateFromIFC(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ExternalResourceReference,System.String,System.Boolean,Autodesk.Revit.DB.RevitLinkOptions)
Creates a new Revit link type from an existing Revit file created via import by reference
of an asscoiated IFC file.
Remarks:
This function is one of a series of steps necessary for linking an IFC file.
To understand how it is used in context, please download the IFC open source code,
and look in the Revit.IFC.Import project at Importer.ImportIFC(ImporterIFC importer),
under the IFCImportAction.Link branch.
This function regenerates the input document.
While the options argument allows specification of a path type, the
input path argument must be a full path. Relative vs. absolute determines
how Revit will store the path, but it needs a complete path to find
the linked document initially.
document:
The document in which to create the Revit link.
resourceReference:
An external resource reference describing the source of the IFC file used in creation.
revitLinkedFilePath:
The path of the existing Revit file that contains elements created via an import by reference operation.
This must be a full path.
recreateLink:
If true, the existing Revit file created via an import by reference operation
will be updated based on the information in the IFC file.  If false, the existing Revit file will be used as-is.
options:
An options class for loading Revit links.
Returns:
An object containing the results of creating and loading
the Revit link type. It contains the ElementId of the new link.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
document already contains a linked model at path revitLinkedFilePath.
-or-
The document is a cloud model.
-or-
The server referenced by the ExternalResourceReference does not exist or
does not implement IExternalResourceServer.
-or-
The server referenced by the ExternalResourceReference cannot support IFC links.
-or-
The ExternalResourceReference (resourceReference) is not in a format
that is supported by its server.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.FileAccessException:
The model cannot be accessed due to lack of access privileges.
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
There is not a valid Revit file at revitLinkedFilePath's location
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Revit cannot customize worksets for this model.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2018